#論理値#########################################
True = ->(t){->(f){t}}
False = ->(t){->(f){f}}

#条件###########################################
If = ->(e1){->(e2){->(e3){e1[e2][e3]}}}

#論理演算#######################################
And = ->(b){->(c){b[c][False]}}
Or = ->(b){->(c){b[True][c]}}
Not = ->(b){b[False][True]}

#ペア###########################################
Pair = ->(f){->(s){->(b){b[f][s]}}}
Fst = ->(p){p[True]}
Snd = ->(p){p[False]}

#恒等関数#######################################
I = ->(y){y}

#数#############################################
Zero = ->(s){->(z){z}}
Scc = ->(n){->(s){->(z){s[n[s][z]]}}}
One = Scc[Zero]
IsZero = ->(m){m[->(x){False}][True]}
Zz = Pair[Zero][Zero]
Ss = ->(p){Pair[Snd[p]][Plus[One][Snd[p]]]}
Prd = ->(m){Fst[m[Ss][Zz]]}

#四則演算#######################################
Plus = ->(m){->(n){->(s){->(z){m[s][n[s][z]]}}}}
Times = ->(m){->(n){m[Plus[n]][Zero]}}

#比較###########################################
Equal = ->(m){->(n){And[IsZero[m[Prd][n]]][IsZero[n[Prd][m]]]}}

#Zコンビネータ##################################
Fix = ->(f){->(x){f[->(y){x[x][y]}]}[->(x){f[->(y){x[x][y]}]}]}

#内部関数#######################################
RealNum = ->(c){c[->(x){x+1}][0]}
GenNum = ->(n){(1..n).inject(Zero){|i| Scc[i]}}
Realbool = ->(b){b[true][false]}
Churchbool = ->(b){if(b);True;else;False;end}
Realeq = ->(m){->(n){Realbool[Equal[m][n]]}}

